Revit 2024 API
PerformanceAdviserRuleId Class
 The unique identifier of a PerformanceAdviserRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class PerformanceAdviserRuleId : GuidEnum
Visual Basic
Public Class PerformanceAdviserRuleId _
	Inherits GuidEnum
Visual C++
public ref class PerformanceAdviserRuleId : public GuidEnum
Remarks
 Each performance adviser rule registered in application must be given a unique id that can be used to identify and unregister rule later.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.PerformanceAdviserRuleId
See Also
PerformanceAdviserRuleId Members
Autodesk.Revit.DB Namespace